import image from './borsch.jpg';
import './App.css';

function App() {
  return (
    <>
    <h1>Український Борщ</h1>
    <h2>Інгредієнти</h2>
    <ul>
      <li>500 г свинини (краще ребра або м'якоть)</li>
      <li>1,5-2 л води</li>
      <li>1 велика буряк</li>
      <li>2 середні моркви</li>
      <li>1 середня цибулина</li>
      <li>2-3 картоплини</li>
      <li>1/4 середньої капусти</li>
      <li>2-3 зубчики часнику</li>
      <li>2 столові ложки томатної пасти або 3 середні помідори</li>
      <li>1 лавровий лист</li>
      <li>Сіль і перець за смаком</li>
      <li>1 столова ложка оцту (за бажанням)</li>
      <li>Зелень (кріп, петрушка) за смаком</li>
      <li>Сметана для подачі</li>
    </ul>
    <ol>
      <li>Промийте свинину під холодною водою. Поріжте на великі шматки.
      Покладіть м'ясо в каструлю, залийте водою і доведіть до кипіння.
      Зніміть піну, що утворилася, і варіть на середньому вогні близько 1-1,5 години до готовності м'яса.</li>
      <li>Буряк очистіть і натріть на великій тертці.
      Моркву натріть на великій тертці.
      Цибулю дрібно наріжте.
      Картоплю очистіть і наріжте кубиками.
      Капусту тонко наріжте.</li>
      <li>У сковороді нагрійте трохи олії.
      Додайте цибулю і обсмажуйте до прозорості.
      Додайте моркву і буряк, тушкуйте на середньому вогні 5-7 хвилин.
      Додайте томатну пасту або дрібно нарізані помідори, оцет, сіль і перець за смаком. Тушкуйте ще 5-7 хвилин.</li>
      <li>Вийміть м'ясо з бульйону, відокремте м'якоть від кісток і поверніть її в каструлю.
      Додайте в бульйон картоплю і варіть 10-15 хвилин до напівготовності.
      Додайте капусту і варіть ще 5-7 хвилин.
      Додайте обсмажені овочі в каструлю.
      Додайте лавровий лист, часник (дрібно нарізаний або пропущений через прес) і варіть ще 10 хвилин.
      При необхідності додайте сіль і перець.</li>
      <li>Зніміть каструлю з вогню і дайте борщу настоятися під кришкою 10-15 хвилин.</li>
      <li>Розлийте борщ по тарілках, додайте сметану і посипте нарізаною зеленню.</li>
    </ol>
    <img src={image} />
    </>
  );
}

export default App;
